<!--
 * @Description: 
 * @Author: charles
 * @Date: 2021-05-05 22:02:56
 * @LastEditors: Please set LastEditors
 * @LastEditTime: 2021-08-16 19:27:02
-->
<template>
  <div ref="root" style="height: 95%"></div>
</template>

<script>
import { Column } from '@antv/g2plot';
import { ref, onMounted, onUnmounted } from "vue";

export default {
  // 组件名称
  name: "demo",
  // 组件状态值
  setup() {
    const root = ref(null);
    let plot = null;

    let data_column = ref([]);
    const loadData = async () => {
      data_column.value = [
        {
          城市: "七台河",
          销售额: 52827.32,
        },
        {
          城市: "万县",
          销售额: 16921.576,
        },
        {
          城市: "三亚",
          销售额: 22698.396,
        },
        {
          城市: "三岔子",
          销售额: 3262.98,
        },
        {
          城市: "三明",
          销售额: 1458.8,
        },
        {
          城市: "上梅",
          销售额: 11704.476,
        },
        {
          城市: "上海",
          销售额: 582450.5679999999,
        },
        {
          城市: "上虞",
          销售额: 10672.872,
        },
        {
          城市: "东丰",
          销售额: 1785.84,
        },
        {
          城市: "东台",
          销售额: 2789.892,
        },
        {
          城市: "东宁",
          销售额: 2706.2,
        },
        {
          城市: "东村",
          销售额: 13692.14,
        },
        {
          城市: "东海",
          销售额: 4508.28,
        },
        {
          城市: "东胜",
          销售额: 12766.068,
        },
        {
          城市: "东莞",
          销售额: 10165.89,
        },
        {
          城市: "东营",
          销售额: 17153.92,
        },
        {
          城市: "中枢",
          销售额: 1050.42,
        },
        {
          城市: "丰县",
          销售额: 10309.516,
        },
        {
          城市: "丰润",
          销售额: 82.04,
        },
        {
          城市: "丰镇",
          销售额: 3507.336,
        },
        {
          城市: "临朐",
          销售额: 833.7,
        },
        {
          城市: "临水",
          销售额: 21443.1,
        },
        {
          城市: "临江",
          销售额: 36496.74,
        },
        {
          城市: "临汾",
          销售额: 26205.48,
        },
        {
          城市: "临沂",
          销售额: 97200.74,
        },
        {
          城市: "临海",
          销售额: 7071.456,
        },
        {
          城市: "临清",
          销售额: 38676.12,
        },
        {
          城市: "丹东",
          销售额: 45447.612,
        },
        {
          城市: "丹江口",
          销售额: 4879.616,
        },
        {
          城市: "丽水",
          销售额: 3983.616,
        },
        {
          城市: "义乌",
          销售额: 34511.624,
        },
        {
          城市: "义马",
          销售额: 1144.024,
        },
        {
          城市: "乌海",
          销售额: 16096.64,
        },
        {
          城市: "乌达",
          销售额: 3474.66,
        },
        {
          城市: "乐城",
          销售额: 3241,
        },
        {
          城市: "乐山",
          销售额: 12561.892,
        },
        {
          城市: "九台",
          销售额: 32535.944,
        },
        {
          城市: "九江",
          销售额: 29890.7,
        },
        {
          城市: "二道江",
          销售额: 4461.24,
        },
        {
          城市: "云浮",
          销售额: 6351.212,
        },
        {
          城市: "云阳",
          销售额: 24699.64,
        },
        {
          城市: "五常",
          销售额: 3771.46,
        },
        {
          城市: "亳州",
          销售额: 16961.14,
        },
        {
          城市: "仙居",
          销售额: 6868.512,
        },
        {
          城市: "仙桃",
          销售额: 16600.164,
        },
        {
          城市: "仪征",
          销售额: 8566.628,
        },
        {
          城市: "任丘",
          销售额: 12106.78,
        },
        {
          城市: "余下",
          销售额: 103.04,
        },
        {
          城市: "余姚",
          销售额: 12621.84,
        },
        {
          城市: "佛山",
          销售额: 7500.388,
        },
        {
          城市: "佳木斯",
          销售额: 63263.34,
        },
        {
          城市: "依兰",
          销售额: 26874.82,
        },
        {
          城市: "保定",
          销售额: 124133.1,
        },
        {
          城市: "信宜",
          销售额: 4771.06,
        },
        {
          城市: "信阳",
          销售额: 38849.412,
        },
        {
          城市: "兖州",
          销售额: 28648.2,
        },
        {
          城市: "八步",
          销售额: 241.64,
        },
        {
          城市: "八面通",
          销售额: 2650.2,
        },
        {
          城市: "公主岭",
          销售额: 21210.756,
        },
        {
          城市: "六合",
          销售额: 5775.98,
        },
        {
          城市: "兰州",
          销售额: 42543.144,
        },
        {
          城市: "兰溪",
          销售额: 15169.028,
        },
        {
          城市: "兰西",
          销售额: 20877.92,
        },
        {
          城市: "兴化",
          销售额: 7848.652,
        },
        {
          城市: "兴城",
          销售额: 5233.032,
        },
        {
          城市: "内江",
          销售额: 43502.788,
        },
        {
          城市: "冷水江",
          销售额: 21350.196,
        },
        {
          城市: "冷水滩",
          销售额: 4608.94,
        },
        {
          城市: "凌源",
          销售额: 11950.596,
        },
        {
          城市: "凤城",
          销售额: 20989.164,
        },
        {
          城市: "利川",
          销售额: 24.696,
        },
        {
          城市: "前郭",
          销售额: 3903.76,
        },
        {
          城市: "剑光",
          销售额: 1811.32,
        },
        {
          城市: "加格达奇",
          销售额: 1801.324,
        },
        {
          城市: "包头",
          销售额: 43217.524,
        },
        {
          城市: "化州",
          销售额: 9078.944,
        },
        {
          城市: "北京",
          销售额: 376814.9000000002,
        },
        {
          城市: "北海",
          销售额: 525.672,
        },
        {
          城市: "北碚",
          销售额: 5338.06,
        },
        {
          城市: "北票",
          销售额: 7948.164,
        },
        {
          城市: "十字路",
          销售额: 6417.88,
        },
        {
          城市: "南京",
          销售额: 8300.068,
        },
        {
          城市: "南充",
          销售额: 23797.284,
        },
        {
          城市: "南台",
          销售额: 5839.848,
        },
        {
          城市: "南宁",
          销售额: 118154.078,
        },
        {
          城市: "南宫",
          销售额: 14725.48,
        },
        {
          城市: "南岔",
          销售额: 24002.16,
        },
        {
          城市: "南平",
          销售额: 11266.22,
        },
        {
          城市: "南昌",
          销售额: 46190.62,
        },
        {
          城市: "南洲",
          销售额: 1111.32,
        },
        {
          城市: "南渡",
          销售额: 23807.56,
        },
        {
          城市: "南票",
          销售额: 3059.868,
        },
        {
          城市: "南通",
          销售额: 26558.504,
        },
        {
          城市: "南阳",
          销售额: 62104.546,
        },
        {
          城市: "南隆",
          销售额: 546,
        },
        {
          城市: "南麻",
          销售额: 5940.48,
        },
        {
          城市: "即墨",
          销售额: 14251.58,
        },
        {
          城市: "原平",
          销售额: 97.58,
        },
        {
          城市: "厦门",
          销售额: 144801.944,
        },
        {
          城市: "友好",
          销售额: 9571.8,
        },
        {
          城市: "双城",
          销售额: 784.84,
        },
        {
          城市: "双阳",
          销售额: 4786.6,
        },
        {
          城市: "双鸭山",
          销售额: 13395.76,
        },
        {
          城市: "台城",
          销售额: 3541.44,
        },
        {
          城市: "叶柏寿",
          销售额: 1199.716,
        },
        {
          城市: "合川",
          销售额: 34747.076,
        },
        {
          城市: "合德",
          销售额: 14716.38,
        },
        {
          城市: "合肥",
          销售额: 82420.548,
        },
        {
          城市: "吉林市",
          销售额: 46497.829,
        },
        {
          城市: "吉舒",
          销售额: 88.34,
        },
        {
          城市: "吉首",
          销售额: 9007.642,
        },
        {
          城市: "启东",
          销售额: 22022.672,
        },
        {
          城市: "吴川",
          销售额: 8995.644,
        },
        {
          城市: "周口",
          销售额: 44941.442,
        },
        {
          城市: "周村",
          销售额: 10413.06,
        },
        {
          城市: "呼兰",
          销售额: 18749.64,
        },
        {
          城市: "呼和浩特",
          销售额: 27756.26,
        },
        {
          城市: "和田",
          销售额: 6236.188,
        },
        {
          城市: "和龙",
          销售额: 2508.8,
        },
        {
          城市: "咸宁",
          销售额: 3641.176,
        },
        {
          城市: "咸水沽",
          销售额: 9269.54,
        },
        {
          城市: "咸阳",
          销售额: 48721.68,
        },
        {
          城市: "哈尔滨",
          销售额: 205688.2309999999,
        },
        {
          城市: "唐家庄",
          销售额: 10473.155,
        },
        {
          城市: "唐寨",
          销售额: 4985.26,
        },
        {
          城市: "唐山",
          销售额: 94901.94,
        },
        {
          城市: "唐河",
          销售额: 1764.896,
        },
        {
          城市: "商丘",
          销售额: 36668.275,
        },
        {
          城市: "嘉兴",
          销售额: 24912.412,
        },
        {
          城市: "嘉善",
          销售额: 1711.08,
        },
        {
          城市: "嘉峪关",
          销售额: 20206.928,
        },
        {
          城市: "四平",
          销售额: 28710.22,
        },
        {
          城市: "图们",
          销售额: 7932.68,
        },
        {
          城市: "坪山",
          销售额: 2715.23,
        },
        {
          城市: "埠河",
          销售额: 11368.224,
        },
        {
          城市: "塔河",
          销售额: 724.5,
        },
        {
          城市: "塘坪",
          销售额: 7726.936,
        },
        {
          城市: "塘沽",
          销售额: 45260.46,
        },
        {
          城市: "夏镇",
          销售额: 4270.56,
        },
        {
          城市: "大冶",
          销售额: 319.788,
        },
        {
          城市: "大同",
          销售额: 133256.41,
        },
        {
          城市: "大庆",
          销售额: 58345.77,
        },
        {
          城市: "大理",
          销售额: 3253.32,
        },
        {
          城市: "大连",
          销售额: 94385.704,
        },
        {
          城市: "大连湾",
          销售额: 3259.592,
        },
        {
          城市: "天津",
          销售额: 471183.5099999999,
        },
        {
          城市: "天长",
          销售额: 22612.59,
        },
        {
          城市: "太原",
          销售额: 171042.6200000001,
        },
        {
          城市: "姜堰",
          销售额: 8361.92,
        },
        {
          城市: "威宁",
          销售额: 6516.44,
        },
        {
          城市: "威海",
          销售额: 16084.32,
        },
        {
          城市: "娄底",
          销售额: 2537.78,
        },
        {
          城市: "嫩江",
          销售额: 253.26,
        },
        {
          城市: "孝感",
          销售额: 18652.256,
        },
        {
          城市: "宁波",
          销售额: 31039.96,
        },
        {
          城市: "宁海",
          销售额: 46008.9,
        },
        {
          城市: "宁阳",
          销售额: 2063.18,
        },
        {
          城市: "安丘",
          销售额: 2400.86,
        },
        {
          城市: "安埠",
          销售额: 4144,
        },
        {
          城市: "安庆",
          销售额: 10239.292,
        },
        {
          城市: "安康",
          销售额: 95.76,
        },
        {
          城市: "安达",
          销售额: 29705.088,
        },
        {
          城市: "安阳",
          销售额: 38320.324,
        },
        {
          城市: "安顺",
          销售额: 12296.9,
        },
        {
          城市: "定州",
          销售额: 10477.32,
        },
        {
          城市: "定陶",
          销售额: 4627.84,
        },
        {
          城市: "宜城",
          销售额: 9582.944,
        },
        {
          城市: "宜宾",
          销售额: 24004.428,
        },
        {
          城市: "宜昌",
          销售额: 34920.592,
        },
        {
          城市: "宜春",
          销售额: 115788.288,
        },
        {
          城市: "宝山",
          销售额: 13980.064,
        },
        {
          城市: "宝应",
          销售额: 4835.46,
        },
        {
          城市: "宣化",
          销售额: 55734.875,
        },
        {
          城市: "宣州",
          销售额: 1007.944,
        },
        {
          城市: "宽甸",
          销售额: 10421.908,
        },
        {
          城市: "宾州",
          销售额: 9814.42,
        },
        {
          城市: "宿州",
          销售额: 137112.395,
        },
        {
          城市: "密山",
          销售额: 24585.995,
        },
        {
          城市: "富拉尔基区",
          销售额: 14902.125,
        },
        {
          城市: "富锦",
          销售额: 12592.58,
        },
        {
          城市: "富阳",
          销售额: 12781.132,
        },
        {
          城市: "寒亭",
          销售额: 11996.88,
        },
        {
          城市: "寿光",
          销售额: 29014.58,
        },
        {
          城市: "小围寨",
          销售额: 1912.96,
        },
        {
          城市: "尚志",
          销售额: 22192.31,
        },
        {
          城市: "山亭",
          销售额: 1022,
        },
        {
          城市: "山城",
          销售额: 30980.04,
        },
        {
          城市: "山河屯",
          销售额: 4699.8,
        },
        {
          城市: "岫岩",
          销售额: 7305.228,
        },
        {
          城市: "岭东",
          销售额: 3353.14,
        },
        {
          城市: "岳阳",
          销售额: 119747.488,
        },
        {
          城市: "州城",
          销售额: 3628.8,
        },
        {
          城市: "巢湖",
          销售额: 40566.624,
        },
        {
          城市: "巨野",
          销售额: 270.06,
        },
        {
          城市: "常州",
          销售额: 72550.24,
        },
        {
          城市: "常德",
          销售额: 50277.15,
        },
        {
          城市: "常熟市",
          销售额: 5245.156,
        },
        {
          城市: "平凉",
          销售额: 19133.24,
        },
        {
          城市: "平南",
          销售额: 5299.28,
        },
        {
          城市: "平庄",
          销售额: 411.264,
        },
        {
          城市: "平度",
          销售额: 18853.66,
        },
        {
          城市: "平遥",
          销售额: 2710.68,
        },
        {
          城市: "平邑",
          销售额: 18395.496,
        },
        {
          城市: "平阴",
          销售额: 364,
        },
        {
          城市: "平顶山",
          销售额: 45482.948,
        },
        {
          城市: "广元",
          销售额: 38601.024,
        },
        {
          城市: "广州",
          销售额: 272960.667,
        },
        {
          城市: "广水",
          销售额: 11205.46,
        },
        {
          城市: "庄河",
          销售额: 5492.508,
        },
        {
          城市: "库尔勒",
          销售额: 8396.5,
        },
        {
          城市: "应城",
          销售额: 12813.024,
        },
        {
          城市: "廉州镇",
          销售额: 7194.278,
        },
        {
          城市: "廉江",
          销售额: 3784.004,
        },
        {
          城市: "廉洲",
          销售额: 20176.345,
        },
        {
          城市: "廊坊",
          销售额: 29600.06,
        },
        {
          城市: "延吉",
          销售额: 26406.8,
        },
        {
          城市: "开化",
          销售额: 47997.572,
        },
        {
          城市: "开原",
          销售额: 5605.18,
        },
        {
          城市: "开封",
          销售额: 77277.2,
        },
        {
          城市: "开远",
          销售额: 24842.72,
        },
        {
          城市: "开通",
          销售额: 23546.32,
        },
        {
          城市: "张家口",
          销售额: 39287.01,
        },
        {
          城市: "张家港",
          销售额: 10376.24,
        },
        {
          城市: "张掖",
          销售额: 6840.036,
        },
        {
          城市: "弥阳",
          销售额: 11865.28,
        },
        {
          城市: "归仁",
          销售额: 2620.128,
        },
        {
          城市: "彭城",
          销售额: 1183.28,
        },
        {
          城市: "徐州",
          销售额: 89802.636,
        },
        {
          城市: "德州",
          销售额: 17934,
        },
        {
          城市: "德惠",
          销售额: 9381.82,
        },
        {
          城市: "德阳",
          销售额: 11823.42,
        },
        {
          城市: "忻州",
          销售额: 19832.624,
        },
        {
          城市: "怀化",
          销售额: 15604.008,
        },
        {
          城市: "怀城",
          销售额: 6093.668,
        },
        {
          城市: "恒山",
          销售额: 17943.38,
        },
        {
          城市: "恩城",
          销售额: 17619.49,
        },
        {
          城市: "恩施",
          销售额: 799.932,
        },
        {
          城市: "惠城",
          销售额: 32897.48,
        },
        {
          城市: "惠州",
          销售额: 22005.277,
        },
        {
          城市: "成都",
          销售额: 123775.932,
        },
        {
          城市: "扬州",
          销售额: 40860.176,
        },
        {
          城市: "扶余",
          销售额: 15231.72,
        },
        {
          城市: "承德",
          销售额: 6583.36,
        },
        {
          城市: "抚顺",
          销售额: 93237.816,
        },
        {
          城市: "拉萨",
          销售额: 4436.32,
        },
        {
          城市: "招远",
          销售额: 38868.48,
        },
        {
          城市: "拜泉",
          销售额: 3225.6,
        },
        {
          城市: "揭阳",
          销售额: 34590.822,
        },
        {
          城市: "敦化",
          销售额: 23641.219,
        },
        {
          城市: "文登",
          销售额: 33296.06,
        },
        {
          城市: "新乡",
          销售额: 38902.332,
        },
        {
          城市: "新余",
          销售额: 18479.16,
        },
        {
          城市: "新民",
          销售额: 2037.168,
        },
        {
          城市: "新泰",
          销售额: 29422.96,
        },
        {
          城市: "新石",
          销售额: 4538.884,
        },
        {
          城市: "新野",
          销售额: 122.92,
        },
        {
          城市: "无城",
          销售额: 4765.775,
        },
        {
          城市: "无锡",
          销售额: 57654.632,
        },
        {
          城市: "日照",
          销售额: 8715.14,
        },
        {
          城市: "昆明",
          销售额: 136537.828,
        },
        {
          城市: "昆阳",
          销售额: 319.536,
        },
        {
          城市: "昌吉",
          销售额: 7224.14,
        },
        {
          城市: "昌图",
          销售额: 9145.332,
        },
        {
          城市: "昌平",
          销售额: 13264.3,
        },
        {
          城市: "昌黎",
          销售额: 6302.24,
        },
        {
          城市: "明光",
          销售额: 2354.8,
        },
        {
          城市: "明月",
          销售额: 2611.98,
        },
        {
          城市: "明水",
          销售额: 17606.54,
        },
        {
          城市: "昭通",
          销售额: 27136.424,
        },
        {
          城市: "晋城",
          销售额: 36235.395,
        },
        {
          城市: "晋江",
          销售额: 49001.379,
        },
        {
          城市: "普兰店",
          销售额: 779.1,
        },
        {
          城市: "景德镇",
          销售额: 68907.3,
        },
        {
          城市: "景洪",
          销售额: 9208.08,
        },
        {
          城市: "曲阜",
          销售额: 8541.96,
        },
      ];
    };
    //初始化图标
    const initChart = () => {
      plot = new Column(root.value, {
        data: data_column.value,
        //  color: 'rgba(0,255,119,1)',
        legend: {
          position: "top-right",
          itemName: {
            style: {
              fill: "#FFFFFF",
              fontFamily: "TencentSans",
              fontSize: 14,
            },
          },
        },
        xField: "城市",
        yField: "销售额",
        //设置图表的颜色
        color: "l(90) 0:#F13586 1:#000",
        // 配置别名（鼠标点击展示）
        meta: {
         销售额: {
            alias: "办理情况",
          },
        },
        //x轴的值
        xAxis: {
          label: {
            autoRotate: false,
            rotate: -45,
            offset: 25,
            style: {
              fill: "#FFFFFF",
              fontFamily: "TencentSans",
              fontSize: 16,
            },
          },
        },
        //y州的数据
        yAxis: {
          grid: {
            line: {
              style: {
                lineDash: [2, 3],
                strokeOpacity: 0.2,
              },
            },
          },
          //底部的导航栏
          label: {
            style: {
              fill: "white",
              fontFamily: "TencentSans",
              fontSize: 16,
            },
          },
        },
        //底部的磁吸栏
        slider: {
        start: 0.1,
        end: 0.2,
      },
        //鼠标点击显示弹出的图标
        tooltip: {
          fields: ["销售额"],
          domStyles: {
            "g2-tooltip": {
              // 背景框样式
              padding: "10px",
              background: "green",
              border: "1px solid #00FFFF",
              color: "#FFFFFF",
              fontSize: "16px",
              lineHeight: "2em",
              fontFamily: "TencentSans",
            },
          },
        },
      });
      plot.render();
    };

    onMounted(async () => {
      await loadData();
      initChart();
    });

    onUnmounted(() => {
      if (plot != null) {
        plot.destroy();
      }
    });

    return {
      root,
    };
  },
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<!--使用了scoped属性之后，父组件的style样式将不会渗透到子组件中，-->
<!--然而子组件的根节点元素会同时被设置了scoped的父css样式和设置了scoped的子css样式影响，-->
<!--这么设计的目的是父组件可以对子组件根元素进行布局。-->
<style scoped>
</style>